package com.zizi.rendezvous.Data;

public class Data {

    //константы
    public static final String ANY_PLACE = "Любое место";
    public static final String ANY_TIME = "Любое время";
    public static final String CHANNEL_ID = "Сообщения";
    public static final String TAG_LOG = "!@#";
    public static final String FRAGMENT_CHAT = "FragmentChat";
    public static final String OTHER = "Прочее";
    public static final String DEFAULT_COUNT_REQUEST_MEETINGS = "31"; // количество бесплатных встреч по умолчанию
    public static final String VERSION_CODE_KEY = "VERSION_CODE_KEY"; // для запроса последней версии с удаленного конфига

    //статусы заявки на встречу
    public static final String STATUS_ACTIVE = "STATUS_ACTIVE";
    public static final String STATUS_NOT_ACTIVE = "STATUS_NOT_ACTIVE";
    public static final String STATUS_MODERATION_FAIL = "STATUS_MODERATION_FAIL";



    //массив с временами
    public static final String[] times = new String[]{
            //"Любое время",
            ANY_TIME,
            "Сейчас",
            "00:00",
            "01:00",
            "02:00",
            "03:00",
            "04:00",
            "05:00",
            "06:00",
            "07:00",
            "08:00",
            "09:00",
            "10:00",
            "11:00",
            "12:00",
            "13:00",
            "14:00",
            "15:00",
            "16:00",
            "17:00",
            "18:00",
            "19:00",
            "20:00",
            "21:00",
            "22:00",
            "23:00"
    };



    //описание регионов временное, пока приложение на стартапе
    public static final String[] regionsTmp = new String[]{
        "Алтайский край",
        "Амурская область",
        "Архангельская область",
        "Астраханская область",
        "Белгородская область",
        "Брянская область",
        "Владимирская область",
        "Волгоградская область",
        "Вологодская область",
        "Воронежская область",
        "Еврейская автономная область",
        "Забайкальский край",
        "Ивановская область",


        "Московская область",
        "Нижегородская область",
        "Республика Мордовия"
    };


    //список всех регионов
    public static final String[] regions = new String[]{
        "Алтайский край",
        "Амурская область",
        "Архангельская область",
        "Астраханская область",
        "Белгородская область",
        "Брянская область",
        "Владимирская область",
        "Волгоградская область",
        "Вологодская область",
        "Воронежская область",
        "Еврейская автономная область",
        "Забайкальский край",
        "Ивановская область",
        "Иркутская область",
        "Кабардино-Балкарская Республика",
        "Калининградская область",
        "Калужская область",
        "Камчатский край",
        "Карачаево-Черкесская Республика",
        "Кемеровская область",
        "Кировская область",
        "Костромская область",
        "Краснодарский край",
        "Красноярский край",
        "Курганская область",
        "Курская область",
        "Ленинградская область",
        "Липецкая область",
        "Магаданская область",
        "Московская область",
        "Мурманская область",
        "Ненецкий автономный округ",
        "Нижегородская область",
        "Новгородская область",
        "Новосибирская область",
        "Омская область",
        "Оренбургская область",
        "Орловская область",
        "Пензенская область",
        "Пермский край",
        "Приморский край",
        "Псковская область",
        "Республика Адыгея",
        "Республика Алтай",
        "Республика Башкортостан",
        "Республика Бурятия",
        "Республика Дагестан",
        "Республика Ингушетия",
        "Республика Калмыкия",
        "Республика Карелия",
        "Республика Коми",
        "Республика Крым",
        "Республика Марий Эл",
        "Республика Мордовия",
        "Республика Саха (Якутия)",
        "Республика Северная Осетия - Алания",
        "Республика Татарстан",
        "Республика Тыва",
        "Республика Хакасия",
        "Ростовская область",
        "Рязанская область",
        "Самарская область",
        "Санкт-Петербург",
        "Саратовская область",
        "Сахалинская область",
        "Свердловская область",
        "Севастополь",
        "Смоленская область",
        "Ставропольский край",
        "Тамбовская область",
        "Тверская область",
        "Томская область",
        "Тульская область",
        "Тюменская область",
        "Удмуртская Республика",
        "Ульяновская область",
        "Хабаровский край",
        "Ханты-Мансийский автономный округ - Югра",
        "Челябинская область",
        "Чеченская Республика",
        "Чувашская Республика - Чувашия",
        "Чукотский автономный округ",
        "Ямало-Ненецкий автономный округ",
        "Ярославская область"

    };



    //Алтайский край - список городов
    public static final String[] altaiRegion = new String[]{
        "Алейск",
        "Барнаул",
        "Белокуриха",
        "Бийск",
        "Горняк",
        "Заринск",
        "Змеиногорск",
        "Камень-на-Оби",
        "Новоалтайск",
        "Рубцовск",
        "Славгород",
        "Яровое"
    };



    //Амурская область - список городов
    public static final String[] amurskayaOblast = new String[]{
        "Белогорск",
        "Благовещенск",
        "Завитинск",
        "Зея",
        "Райчихинск",
        "Свободный",
        "Сковородино",
        "Тында",
        "Циолковский",
        "Шимановск"
    };



    //Архангельская область - список городов
    public static final String[] arkhangelskRegion = new String[]{
        "Архангельск",
        "Коряжма",
        "Котлас",
        "Мирный",
        "Новодвинск",
        "Онега",
        "Северодвинск"
    };



    //Астраханская область - список городов
    public static final String[] astrakhanRegion = new String[]{
        "Астрахань",
        "Ахтубинск",
        "Знаменск",
        "Камызяк",
        "Нариманов",
        "Харабали"
    };



    //Белгородская область - список городов
    public static final String[] belgorodRegion = new String[]{
        "Алексеевка",
        "Белгород",
        "Бирюч",
        "Валуйки",
        "Грайворон",
        "Губкин",
        "Короча",
        "Новый Оскол",
        "Старый Оскол",
        "Строитель",
        "Шебекино"

    };



    //Брянская область - список городов
    public static final String[] bryanskRegion = new String[]{
        "Брянск",
        "Дятьково",
        "Жуковка",
        "Злынка",
        "Карачев",
        "Клинцы",
        "Мглин",
        "Новозыбков",
        "Почеп",
        "Севск",
        "Сельцо",
        "Стародуб",
        "Сураж",
        "Трубчевск",
        "Унеча",
        "Фокино"

    };



    //Владимирская область - список городов
    public static final String[] vladimirRegion = new String[]{
        "Александров",
        "Владимир",
        "Вязники",
        "Гороховец",
        "Гусь-Хрустальный",
        "Камешково",
        "Карабаново",
        "Киржач",
        "Ковров",
        "Кольчугино",
        "Костерёво",
        "Курлово",
        "Лакинск",
        "Меленки",
        "Муром",
        "Петушки",
        "Покров",
        "Радужный",
        "Собинка",
        "Струнино",
        "Судогда",
        "Суздаль",
        "Юрьев-Польский",

    };



    //Волгоградская область - список городов
    public static final String[] volgogradRegion = new String[]{
        "Волгоград",
        "Волжский",
        "Дубовка",
        "Жирновск",
        "Калач-на-Дону",
        "Камышин",
        "Котельниково",
        "Котово",
        "Краснослободск",
        "Ленинск",
        "Михайловка",
        "Николаевск",
        "Новоаннинский",
        "Палласовка",
        "Петров Вал",
        "Серафимович",
        "Суровикино",
        "Урюпинск",
        "Фролово"

    };



    //Вологодская область - список городов
    public static final String[] vologodskayaOblast = new String[]{
        "Бабаево",
        "Белозерск",
        "Великий Устюг",
        "Вологда",
        "Вытегра",
        "Грязовец",
        "Кадников",
        "Кириллов",
        "Красавино",
        "Никольск",
        "Сокол",
        "Тотьма",
        "Усолье",
        "Устюжна",
        "Харовск",
        "Череповец"

    };



    //Воронежская область - список городов
    public static final String[] voronezhRegion = new String[]{
        "Бобров",
        "Богучар",
        "Борисоглебск",
        "Бутурлиновка",
        "Воронеж",
        "Калач",
        "Лиски",
        "Нововоронеж",
        "Новохопёрск",
        "Острогожск",
        "Павловск",
        "Поворино",
        "Россошь",
        "Семилуки",
        "Эртиль"

    };



    //Еврейская автономная область - список городов
    public static final String[] jewishAutonomousRegion = new String[]{
            "Биробиджан",
            "Облучье"

    };



    //Забайкальский край - список городов
    public static final String[] transbaikalRegion = new String[]{
            "Балей",
            "Борзя",
            "Краснокаменск",
            "Могоча",
            "Нерчинск",
            "Петровск-Забайкальский",
            "Сретенск",
            "Хилок",
            "Чита",
            "Шилка"

    };



    //Ивановская область - список городов
    public static final String[] ivanovoRegion = new String[]{
        "Вичуга",
        "Гаврилов Посад",
        "Заволжск",
        "Иваново",
        "Кинешма",
        "Комсомольск",
        "Кохма",
        "Наволоки",
        "Плёс",
        "Приволжск",
        "Пучеж",
        "Родники",
        "Тейково",
        "Шуя",
        "Южа",
        "Юрьевец",

    };








    //Московская область - список городов
    public static final String[] moscowRegion = new String[]{
        "Апрелевка",
        "Балашиха",
        "Белоозёрский",
        "Бронницы",
        "Верея",
        "Видное",
        "Волоколамск",
        "Воскресенск",
        "Высоковск",
        "Голицыно",
        "Дедовск",
        "Дзержинский",
        "Дмитров",
        "Долгопрудный",
        "Домодедово",
        "Дрезна",
        "Дубна",
        "Егорьевск",
        "Жуковский",
        "Зарайск",
        "Звенигород",
        "Ивантеевка",
        "Истра",
        "Кашира",
        "Клин",
        "Коломна",
        "Королёв",
        "Котельники",
        "Красноармейск",
        "Красногорск",
        "Краснозаводск",
        "Краснознаменск",
        "Кубинка",
        "Куровское",
        "Ликино - Дулёво",
        "Лобня",
        "Лосино-Петровский",
        "Луховицы",
        "Лыткарино",
        "Люберцы",
        "Можайск",
        "Москва",
        "Мытищи",
        "Наро-Фоминск",
        "Ногинск",
        "Одинцово",
        "Озёры",
        "Орехово-Зуево",
        "Павловский Посад",
        "Пересвет",
        "Подольск",
        "Протвино",
        "Пушкино",
        "Пущино",
        "Раменское",
        "Реутов",
        "Рошаль",
        "Руза",
        "Сергиев Посад",
        "Серпухов",
        "Солнечногорск",
        "Старая Купавна",
        "Ступино",
        "Талдом",
        "Фрязино",
        "Химки",
        "Хотьково",
        "Черноголовка",
        "Чехов",
        "Шатура",
        "Щёлково",
        "Электрогорск",
        "Электросталь",
        "Электроугли",
        "Яхрома"
    };


    //Нижегородская область - список городов
    public static final String[] nizhnyNovgorodRegion = new String[]{
        "Арзамас",
        "Балахна",
        "Богородск",
        "Бор",
        "Ветлуга",
        "Володарск",
        "Ворсма",
        "Выкса",
        "Горбатов",
        "Городец",
        "Дзержинск",
        "Заволжье",
        "Княгинино",
        "Кстово",
        "Кулебаки",
        "Лукоянов",
        "Лысково",
        "Навашино",
        "Нижний Новгород",
        "Павлово",
        "Первомайск",
        "Перевоз",
        "Саров",
        "Семенов",
        "Сергач",
        "Урень",
        "Чкаловск",
        "Шахунья"
    };



    //Республика Мордовия - список городов
    public static final String[] theRepublicOfMordovia = new String[]{
            "Ардатов",
            "Инсар",
            "Ковылкино",
            "Краснослободск",
            "Рузаевка",
            "Саранск",
            "Темников"

    };


}
